In [4]:
import pandas as pd

In [9]:
df = pd.DataFrame([
    ['Kim', 22, '010-0000-1234', 'M'],
    ['Na', 26, '010-0000-5678', 'M'],
    ['Park', 23, '010-1234-1234', 'F'],
    ['Lee', 24, '010-5678-5678', 'F']
], columns=['Name', 'Age', 'Phone', 'Gender'])

In [13]:
df[(df['Gender'] == 'F') & (df['Age'] >= 24)]

  Name  Age          Phone Gender
3  Lee   24  010-5678-5678      F

In [ ]:
df['Age'] = df['Age'] * 2

In [19]:
df

   Name  Age          Phone Gender
0   Kim   44  010-0000-1234      M
1    Na   52  010-0000-5678      M
2  Park   46  010-1234-1234      F
3   Lee   48  010-5678-5678      F

In [21]:
PN = '010-1234-1234'

In [25]:
PN.split('-')[-1]

'1234'

In [30]:
df['Last PN'] = df['Phone'].str.split('-').str[-1] ##항상 str 붙이기

In [31]:
df

   Name  Age          Phone Gender Last PN
0   Kim   44  010-0000-1234      M    1234
1    Na   52  010-0000-5678      M    5678
2  Park   46  010-1234-1234      F    1234
3   Lee   48  010-5678-5678      F    5678

In [36]:
df.to_csv('result.csv', encoding='euckr', index=False)

In [38]:
df2 = pd.read_csv('result.csv', encoding='euckr')

In [39]:
df2

   Name  Age          Phone Gender  Last PN
0   Kim   44  010-0000-1234      M     1234
1    Na   52  010-0000-5678      M     5678
2  Park   46  010-1234-1234      F     1234
3   Lee   48  010-5678-5678      F     5678